//  Напишите программу, которая принимает на вход трёхзначное число
//  и на выходе показывает вторую цифру этого числа.
/*
void method_one ()
{
     Console.Write("three-digit number: ");
     int num = Convert.ToInt32(Console.ReadLine());
     {
        Console.WriteLine(num>99 ? num.ToString()[1] : '-');
        Console.ReadKey(true);

     }
   
      Console.Write(num);
    
}
method_one();

*/

//Напишите программу, которая выводит третью цифру 
//заданного числа или сообщает, что третьей цифры нет.
/*
void method_two ()
{
     Console.Write("three-digit number: ");
     int num = Convert.ToInt32(Console.ReadLine());
     if(num> 100)
     {
        Console.WriteLine(num>99 ? num.ToString()[2] : '-');
        Console.ReadKey(true);
     }
     else
     {
         Console.WriteLine(0);
     }
   
      Console.Write(num);
    
}
method_two();
*/

//Напишите программу, которая принимает на вход цифру, 
//обозначающую день недели, и проверяет, является ли этот день выходным.
/*
void DayOFF ()
{
     Console.Write("day of the week number: ");
     int num = Convert.ToInt32(Console.ReadLine());

     int day = num;

     if (num<6 & num>1)
     {
         Console.WriteLine(" working day");
         
     }
     else
     {
         Console.WriteLine(" day off");
        
     }
}

DayOFF ();
*/

//26/04/2022


     